# 판다스 데이터 분석

In [36]:
import numpy as np
import pandas as pd

### 시리즈(Series)

In [37]:
s = pd.Series([9904312,3448737,2890451,2466052],
index=["서울","부산","인천","대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [38]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [39]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [40]:
s.name = "인구"
s.index.name = "도시"

In [41]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [42]:
s[1],s['부산']

(3448737, 3448737)

In [43]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [44]:
s[["서울","대구","부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [45]:
s[(250e4 <s)&(s<500e4)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [46]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [47]:
s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [48]:
s0 = pd.Series(range(3),index=["a","b","c"])
s0

a    0
b    1
c    2
dtype: int64

In [49]:
s0.a

0

In [50]:
"서울" in s

True

In [51]:
for k,v in s.items():
    print(f'{k} = {v}')

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [52]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},index=["부산", "서울", "인천", "대전"])

In [53]:
ds = s-s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [54]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [55]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [56]:
# 인구 증가율(%)
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

### 데이터의 갱신,추가,삭제

In [58]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [59]:
rs["대구"]=1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [60]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [70]:
a_6 = pd.Series([83,81,79,79,80,73],index=['NC','KT','두산','LG','키움','KIA'])
a_6

NC     83
KT     81
두산     79
LG     79
키움     80
KIA    73
dtype: int64

In [71]:
b_3_5 = pd.Series([79,79,80],index=['두산','LG','키움'])
b_3_5

두산    79
LG    79
키움    80
dtype: int64

In [72]:
dab = a_6 - b_3_5
dab

KIA    NaN
KT     NaN
LG     0.0
NC     NaN
두산     0.0
키움     0.0
dtype: float64

In [65]:
dab[dab.notnull()]

LG    0.0
두산    0.0
키움    0.0
dtype: float64

In [80]:
data = {
    "2015":[9904312,3448737,2890451,2466052],
    "2010":[9631482,3393191,2632035,2431774],
    "2005":[9762546,3512547,2517680,2456016],
    "2000":[9853972,3655437,2466338,2473990],
    "지역":["수도권","경상권","수도권","경상권"],
    "2010-2015 증가율":[0.0283,0.0163,0.0982,0.0141]
}
columns = ["지역","2015","2010","2005","2000","2010-2015 증가율"]
index = ["서울","부산","인천","대구"]
df = pd.DataFrame(data,index=index,columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [81]:
df_1 = pd.DataFrame(data)
df_1

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

In [82]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [83]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [86]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [87]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [90]:
data = {
    "2015":[111,2,112,122,"이천십오년"],
    "2016":[112,3,119,123,"이천십육년"],
    "2017":[113,4,112,124,"이천십칠년"],
    "2018":[114,5,119,125,"이천십팔년"],
    "2019":[115,6,112,126,"이천십구년"]
}
columns = ["2015","2016","2017","2018","2019"]
index = ["숫자","숫자","숫자","숫자","한글"]
pan = pd.DataFrame(data,columns=columns,index = index)
pan

     2015   2016   2017   2018   2019
숫자    111    112    113    114    115
숫자      2      3      4      5      6
숫자    112    119    112    119    112
숫자    122    123    124    125    126
한글  이천십오년  이천십육년  이천십칠년  이천십팔년  이천십구년

In [91]:
pan.T

       숫자 숫자   숫자   숫자     한글
2015  111  2  112  122  이천십오년
2016  112  3  119  123  이천십육년
2017  113  4  112  124  이천십칠년
2018  114  5  119  125  이천십팔년
2019  115  6  112  126  이천십구년

In [92]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [96]:
# "2010-2015 증가율" 열 갱신
df["2010-2015 증가율"] = df["2010-2015 증가율"]*100

In [97]:
#"205-2010 증가율"이라는 이름의 열 추가
df["2005-2010 증가율"] = ((df["2010"]-df["2005"])/df["2005"]*100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [98]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [99]:
#하나의 열만 인덱싱하면 시리즈가 반환된다.
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [101]:
#여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다.
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [102]:
#순서가 없기 때문에 순서를 나타내는 정수형 인덱스df[0]로 주면 오류가 일어난다 df["asdasd"]형태로 주어야 한다
#단 인덱스가 정수형이였다면 사용할수 있다

### 행 인덱싱

In [104]:
df[:1]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [107]:
df["서울":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40

In [109]:
df["2015"]["서울"]

9904312

### 개별 데이터 인덱싱

In [110]:
df['2015']['서울']

9904312

### 개별데이터 인덱싱 - 열, 행 순서

In [137]:
data = {
    "국어":[20,90,70,30],
    "영어":[90,70,60,40],
    "수학":[90,60,80,70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향","몽룡","향단","방자"]
df = pd.DataFrame(data,index=index,columns=columns)
df

    국어  영어  수학
춘향  20  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [138]:
pd.Series(data["수학"],index=index)

춘향    90
몽룡    60
향단    80
방자    70
dtype: int64

In [141]:
df[["국어","영어"]]

    국어  영어
춘향  20  90
몽룡  90  70
향단  70  60
방자  30  40

In [146]:
df['평균값'] = ((df['국어']+df['영어']+df['수학'])/3).round(2)
df

    국어  영어  수학    평균값
춘향  20  90  90  66.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [153]:
df["영어"]["방자"] = 80
df

    국어  영어  수학    평균값
춘향  20  90  90  66.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [154]:
df['평균값'] = ((df['국어']+df['영어']+df['수학'])/3).round(2)
df

    국어  영어  수학    평균값
춘향  20  90  90  66.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [205]:
df[:1]

    국어  영어  수학    평균값
춘향  20  90  90  66.67

In [208]:
df.T["향단"]

국어     70.0
영어     60.0
수학     80.0
평균값    70.0
Name: 향단, dtype: float64